Repository: michaelrsweet/stringsutil
Catalog: *.strings
Languages: es, fr

source: --help Show program help.
es: --help Mostrar ayuda del programa.
fr: --help Afficher l'aide du programme.

source: --version Show program version.
es: --version Mostrar versi√≥n del programa.
fr: --version Afficher la version du programme.

source: -A API-KEY Specify LibreTranslate API key.
es: -A API-KEY Especifique la clave API de LibreTranslate.

source: -T URL Specify LibreTranslate server URL.
es: -T URL Spécifiez l'URL du serveur LibreTranslate.

source: -a Add new strings (import).
es: -a A√±adir nuevas cuerdas (import).
fr: -a Ajouter de nouvelles chaînes (import).

source: -c Remove old strings (merge).
es: -c Quitar viejas cuerdas (merge.)
fr: -c Retirer les vieilles chaînes (merge).

source: -f FILENAME.strings Specify strings file.
es: -f NOMBRE.strings Especifique el archivo de cadenas.
fr: -f NOM.strings Spécifiez le fichier chaîne.

source: -l LOCALE Specify locale/language ID.
es: -l LOCALE Spécifiez l'identifiant de la langue/des paramètres régionaux.
fr: -l LOCALE Indiquez l'identifiant local/langue.

source: -n NAME Specify function/macro name for localization.
es: -n NOMBRE Especifique el nombre de función/macro para la localización.
fr: -n NOM Spécifiez le nom de la fonction/macro pour la localisation.

source: export Export strings to GNU gettext .po or C source file.
es: export Exportar cadenas a GNU gettext .po o archivo fuente C.
fr: export Exporter des chaînes vers le fichier source GNU gettext .po ou C.

source: import Import strings from GNU gettext .po or .strings file.
es: import Importar cadenas de GNU gettext .po o .strings file.
fr: import Importer des chaînes de fichiers GNU gettext .po ou .strings.

source: merge Merge strings from another strings file.
es: merge Combina cadenas de otro archivo de cadenas.
fr: merge Fusionner les chaînes d'un autre fichier chaîne.

source: report Report untranslated strings in the specified strings file(s).
es: report Informe cadenas no traducidas en el fichero(s) de cadenas especificadas.
fr: report Signaler des chaînes non traduites dans le ou les fichiers de chaînes sp√©cifi√©s.

source: scan Scan C/C++ source files for strings.
es: scan Escanear archivos fuente C/C+ para cadenas.
fr: scan Scanner les fichiers sources C/C+ pour les chaînes.

source: translate Translate strings.
es: translate Traducir cadenas.

source: Commands:
es: Comandos:
fr: Commandes :

source: Options:
es: Opciones:

source: Usage: stringsutil [OPTIONS] COMMAND FILENAME(S)
es: Usage: stringsutil [OPCIONES] COMANDO NOMBRE(S)
fr: Utilisation: stringsutil [OPTIONS] COMMANDE NOM(S)

source: stringsutil: %d added, %d ignored, %d modified.
es: stringsutil: %d a√±adido, %d ignorado, %d modificada.
fr: stringsutil: %d ajouté, %d ignoré, %d modifié.

source: stringsutil: %d new strings.
es: stringsutil: %d nuevas cuerdas.
fr: stringsutil: %d nouvelles chaînes.

source: stringsutil: %d string(s), %d (%d%%) translated, %d (%d%%) untranslated in '%s'.
es: stringsutil: %d cuerda(s), %d (%d%%) traducido, %d (%d%%) no traducido en '%s'.

source: stringsutil: '%s' is not translated in '%s'.
es: stringsutil: '%s' no está traducido en '%s'.

source: stringsutil: '%s' needs to be merged, %d missing and %d old string(s).
es: stringsutil: '%s' necesita ser fusionado, %d faltantes y %d cadenas antiguas.

source: stringsutil: 1 new string.
es: stringsutil: 1 nueva cuerda.
fr: stringsutil: 1 nouvelle chaîne.

source: stringsutil: Added %d string(s), removed %d string(s).
es: stringsutil: A√±adido %d cuerda(s), retirada %d cuerda(s).
fr: stringsutil: Ajout de chaînes %d, suppression de chaînes %d.

source: stringsutil: Expected %s filename.
es: stringsutil: Nombre de archivo %s esperado.
fr: stringsutil: Nom de fichier attendu %.

source: stringsutil: Expected '-n FUNCTION-NAME' option.
es: stringsutil: Opci√≥n esperada '-n NOMBRE'.
fr: stringsutil: Option prévue '-n NOM'.

source: stringsutil: Expected LibreTranslate API key after '-A'.
es: stringsutil: La clave de la API LibreTranslate esperada después de -A.
fr: stringsutil: La clé de l'API LibreTranslate attendue après -A.

source: stringsutil: Expected LibreTranslate URL after '-T'.
es: stringsutil: Expected LibreTranslate URL después -T.
fr: stringsutil: attendu LibreTranslate URL après -T.

source: stringsutil: Expected command name.
es: stringsutil: Nombre de comando esperado.
fr: stringsutil: Nom de commandement attendu.

source: stringsutil: Expected function name after '-n'.
es: stringsutil: Nombre de función esperado después de '-n'.
fr: stringsutil: Nom de fonction attendu après '-n'.

source: stringsutil: Expected language code after '-l'.
es: stringsutil: Código de idioma esperado después de -l.
fr: stringsutil: Code de langue attendu après -l.

source: stringsutil: Expected strings file.
es: stringsutil: Archivo de cadenas esperadas.
fr: stringsutil: Fichier de chaîne attendu.

source: stringsutil: Expected strings filename after '-f'.
es: stringsutil: Nombre de archivo de cadenas esperadas despu√©s '-f'.
fr: stringsutil: Nom de fichier des chaînes attendu après '-f'.

source: stringsutil: Ignoring old string '%s'...
es: stringsutil: Ignorando la cadena antigua '%s'.
fr: stringsutil: Ignorer les vieux pourcentages.

source: stringsutil: Localized as '%s'.
es: stringsutil: Localizado como %s.
fr: stringsutil: Localisé en %.

source: stringsutil: Lost connection to translation server: %s
es: stringsutil: Se perdió la conexión con el servidor de traducción: %s

source: stringsutil: No new strings.
es: stringsutil: No hay nuevas cuerdas.
fr: stringsutil: Pas de nouvelles chaînes.

source: stringsutil: No strings in '%s'.
es: stringsutil: Sin cuerdas en '%s'.

source: stringsutil: Syntax error on line %d of '%s'.
es: stringsutil: Error sintaxis en l√≠nea %d de '%s'.
fr: stringsutil: Erreur de syntaxe sur la ligne %d de '%s'.

source: stringsutil: Too many files.
es: stringsutil: Demasiados archivos.
fr: stringsutil: Trop de fichiers.

source: stringsutil: Translated %d string(s).
es: stringsutil: Traducido %d string(s.)

source: stringsutil: Translated format string does not match '%s' in '%s'.
es: stringsutil: La cadena de formato traducido no coincide con %s en '%s'.

source: stringsutil: Translating %lu strings to '%s'...
es: stringsutil: Traduciendo cadenas %lu a '%s'...

source: stringsutil: Translating '%s'...
es: stringsutil: Traduciendo %s.
fr: stringsutil: Traduire des %.

source: stringsutil: Unable to connect to '%s': %s
es: stringsutil: Incapaz de conectar a %s: %s
fr: stringsutil: Incapable de se connecter ‡0e0 %: %s

source: stringsutil: Unable to create '%s': %s
es: stringsutil: Incapaz de crear '%s': %s
fr: stringsutil: Incapable de créer des '%s': %s

source: stringsutil: Unable to export '%s': %s
es: stringsutil: Incapaz de exportar '%s': %s
fr: stringsutil: Incapable d'exporter '%s': %s

source: stringsutil: Unable to import '%s': %s
es: stringsutil: Incapaz de importar '%s': %s
fr: stringsutil: Incapable d'importer '%s': %s

source: stringsutil: Unable to load '%s': %s
es: stringsutil: Incapaz de cargar '%s': %s
fr: stringsutil: Incapable d'charger '%s': %s

source: stringsutil: Unable to merge '%s': %s
es: stringsutil: Incapaz de combinar '%s': %s
fr: stringsutil: Incapable d'fusionner '%s': %s

source: stringsutil: Unable to open source file '%s': %s
es: stringsutil: Incapaz de abrir el archivo fuente '%s': %s
fr: stringsutil: Incapable d'ouvrir le fichier source '%s': %s

source: stringsutil: Unable to report on '%s': %s
es: stringsutil: Incapaces de informar sobre '%s': %s
fr: stringsutil: Incapable de faire rapport '%s': %s

source: stringsutil: Unable to send translation request: %s
es: stringsutil: No se puede enviar la solicitud de traducción: %s

source: stringsutil: Unable to translate '%s': %s
es: stringsutil: Incapaz de traducir %s: %s
fr: stringsutil: Incapable de traduire %s: %s

source: stringsutil: Unable to translate from '%s': %s
es: stringsutil: Incapaz de traducir desde %s: %s
fr: stringsutil: Incapable de traduire ‡0e0 partir de %s: %s

source: stringsutil: Unknown export format for '%s'.
es: stringsutil: Formato de exportaci√≥n desconocido '%s'.
fr: stringsutil: Format d'exportation inconnu '%s'.

source: stringsutil: Unknown import format for '%s'.
es: stringsutil: Formato de importaci√≥n desconocido '%s'.
fr: stringsutil: Format d'importation inconnu '%s'.

source: stringsutil: Unknown option '%s'.
es: stringsutil: Opci√≥n desconocida '%s'.
fr: stringsutil: Option inconnue '%s'.

source: stringsutil: Unknown option '-%c'.
es: stringsutil: Opci√≥n desconocida '-%c'.
fr: stringsutil: Option inconnue '-%c'.

source: stringsutil: You must specify a LibreTranslate server with the '-t' option or the LIBRETRANSLATE_URL environment variable.
es: stringsutil: Debe especificar un servidor LibreTranslate con la opción -t o el LIBRETRANSLATE_ variable entorno URL.
fr: stringsutil: Vous devez spécifier un serveur LibreTranslate avec l'option -t ou le LIBRETRANSLATE_URL variable d'environnement.

source: stringsutil: You must specify a language code with the '-t' option.
es: stringsutil: Debe especificar un código de idioma con la opción -t.
fr: stringsutil: Vous devez spécifier un code de langue avec l'option -t.
